Revit 2027 API
DocumentDifference.GetModifiedElementIds Method
 Modified element id collection.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ISet<ElementId> GetModifiedElementIds()
Public Function GetModifiedElementIds As ISet(Of ElementId)
public:
ISet<ElementId^>^ GetModifiedElementIds()
member GetModifiedElementIds : unit -> ISet<ElementId>
Return Value
ISet<ElementId>
See Also
Reference
DocumentDifference Class
Autodesk.Revit.DB Namespace